{
  "app_name": "vector-brick-puzzle-tetromino-fit",
  "category": "games",
  "folder_name": "category/games/2026/02/20260209-165052-vector-brick-puzzle-tetromino-fit",
  "description": "Fit classic tetromino shapes into a 10x10 grid to clear lines and score high points.",
  "rationale": "This game focuses on spatial awareness and strategic placement without the pressure of falling speed found in Tetris. It targets puzzle enthusiasts who enjoy logic-based inventory management and serves as an excellent environment for AI agents to learn optimal tiling strategies and long-term planning.",
  "details": "The game is a simplified 10x10 grid-based puzzle. Players are given three random tetromino pieces (blocks) at a time. They must drag and place these pieces onto any empty spot on the grid. Unlike Tetris, there is no gravity; pieces stay where they are placed. When a full row or a full column is occupied by blocks, that line is cleared and removed from the board, granting points. The game ends when none of the current three pieces can fit anywhere on the remaining grid space. The complexity lies in managing space to avoid gridlock.",
  "pyproject_toml": {
    "project": {
      "name": "vector-brick-puzzle-tetromino-fit",
      "version": "0.1.0",
      "dependencies": [
        "pygame>=2.5.0"
      ]
    }
  },
  "technical_spec": {
    "grid_size": "10x10",
    "cell_pixels": 40,
    "ui_colors": {
      "background": "#121212",
      "grid_line": "#333333",
      "block_active": "#00ADB5",
      "text": "#EEEEEE"
    },
    "scoring_system": {
      "placement": 10,
      "line_clear": 100,
      "multi_line_bonus": "multiplier * total_lines"
    }
  },
  "how_to_build": "uv sync",
  "how_to_start": "uv run main.py",
  "how_to_stop": "kill $PPID or close the window",
  "how_to_play": "1. Drag a piece from the bottom tray to the 10x10 grid using the Mouse (Left Click and Drag). 2. Fill a complete horizontal row or vertical column to clear blocks and earn 100 points. 3. Earn 10 points for every block segment placed. 4. The game is over when the grid is too full to place any of the three available pieces. 5. AI agents should prioritize leaving space for large 3x3 or 1x5 blocks to avoid early termination.",
  "how_to_cleanup": "rm -rf .venv",
  "screenshot": "No screenshot available"
}